{"trait": "First-Time Homebuyers", "name": "Home 1", "price": 160000, "id": 1, "true_value": 400000, "desc": "Ideal for first-time homebuyers, this charming 3-bedroom, 2-bath home offers 1,500 sq. ft. of comfortable living space in a peaceful suburban neighborhood. Updated modern kitchen and bathrooms (2020) and a recently replaced HVAC system (2018) ensure convenience and low maintenance. The property features a 2-car garage and a manageable yard, perfect for a busy lifestyle. Close to parks, shopping, and highways, it combines safety (neighborhood rating: 8) with accessibility. A budget-friendly choice to start your homeownership journey!"}  
{"trait": "First-Time Homebuyers", "name": "Home 2", "price": 160000, "id": 1, "true_value": 400000, "desc": "Perfect for first-time homebuyers, this 3-bedroom, 2-bath home offers modern comfort in a safe, quiet suburban neighborhood. Built in 2010, it features an updated kitchen, a bright living room with high ceilings, and a finished basement. The sizable lot includes a well-maintained lawn with an irrigation system, and the two-car garage adds convenience. Located near shopping and major highways, with excellent schools and low HOA fees, this freshly painted home with hardwood floors is move-in ready—ideal for starting your homeownership journey!"}  
{"trait": "First-Time Homebuyers", "name": "Home 3", "price": 160000, "id": 1, "true_value": 400000, "desc": "This cozy 3-bedroom, 2-bath home is a fantastic choice for first-time buyers. Built in 2000, it features a modern kitchen, a bright living area with high ceilings, and a main-floor master bedroom. Recent updates, including the HVAC system (2018), add peace of mind. With fresh paint, a spacious yard, and a prime location near parks, shopping, and highways, this home combines comfort, convenience, and room to grow."}  
{"trait": "First-Time Homebuyers", "name": "Home 4", "price": 160000, "id": 1, "true_value": 400000, "desc": "This 3-bedroom, 2-bath home is perfect for first-time buyers seeking comfort and convenience. Built in 1995, it features a modern kitchen, a bright living room with high ceilings, and a finished basement. The well-maintained HVAC system ensures reliability, while the 2-car garage and close proximity to parks and shopping make daily life easy. Fresh paint, hardwood floors, and a safe neighborhood with an affordable HOA add to its charm—a great place to start your homeownership journey."}  
{"trait": "Upgrade to a Larger Home", "name": "Home 5", "price": 190000, "id": 2, "true_value": 475000, "desc": "Perfect for families looking to upgrade, this spacious 4-bedroom, 3-bath home in a top-rated suburban neighborhood offers room to grow. Highlights include a modern kitchen, a dedicated home office, and a guest room. The two-story living room and large, naturally lit basement provide ample living space, while the two-car garage and well-maintained yard with an irrigation system add convenience. Located near parks and shopping, with fresh paint, hardwood floors, and high ceilings, this home is ideal for a growing family seeking comfort and style in a safe 10/10 neighborhood."} 
{"trait": "Upgrade to a Larger Home", "name": "Home 6", "price": 190000, "id": 2, "true_value": 475000, "desc": "Ideal for families upgrading, this 4-bedroom, 3-bath home in a top-rated suburban neighborhood offers space and comfort. It features a modern kitchen, updated bathrooms, a home office, and a guest room. The large backyard, with an irrigation system, is perfect for kids. Recent updates include a newer HVAC system and water heater. Close to parks, shopping, and highways, with high ceilings, hardwood floors, and a safe community, this home is perfect for your growing family."} 
{"trait": "Upgrade to a Larger Home", "name": "Home 7", "price": 190000, "id": 2, "true_value": 475000, "desc": "Perfect for a growing family, this spacious home in a highly sought-after school district has been thoughtfully updated. It boasts a sleek, modern kitchen, soaring ceilings, hardwood flooring, and a stunning two-story living area. The expansive lot, complete with an irrigation system, is just minutes from parks and shopping. Additional features include a dedicated home office, a guest room, and a basement with a private entrance for added versatility. Located in a secure suburban community near major highways, and with a new HVAC system, roof, and water heater."} 
{"trait": "Upgrade to a Larger Home", "name": "Home 8", "price": 180000, "id": 2, "true_value": 400000, "desc": "Designed for a growing family, this spacious home in a top-rated school district offers comfort and convenience. It features an open-plan living area, a modern kitchen, a home office, and four bedrooms, including a master suite and guest room. The large lot provides plenty of outdoor space and is located near parks, shopping, and major highways. Additional highlights include a two-car garage, hardwood floors, high ceilings, and a recently updated HVAC system and water heater. Situated in a secure neighborhood, this home is ready to become your family’s dream haven."} 
{"trait": "Downsizing", "name": "House 1", "price": 160000, "id": 3, "true_value": 400000, "desc": "This cozy 2-bedroom, 2-bath home in a vibrant urban neighborhood offers a perfect balance of comfort and convenience. Built in 2000, it features a modern kitchen with updated appliances, hardwood floors, and a manageable layout ideal for low-maintenance living. Recent upgrades include a 2015 HVAC system and a 2018 water heater. Located near healthcare facilities, parks, and shopping, with an 8/10 safety rating, this home is an excellent choice for those seeking a simpler, more relaxed lifestyle."} 
{"trait": "Downsizing", "name": "House 2", "price": 160000, "id": 3, "true_value": 400000, "desc": "This 2-bedroom, 2-bath home in a vibrant urban neighborhood is ideal for those seeking a simpler lifestyle. With modern appliances, updated kitchen and bathrooms, and fresh paint, it’s designed for low-maintenance living. Hardwood floors, high ceilings, and a new HVAC system add comfort and style. Conveniently located near healthcare, parks, shopping, and public transportation, the home sits in a safe community with an affordable HOA fee. A perfect choice for a hassle-free retirement!"} 
{"trait": "Downsizing", "name": "House 3", "price": 150000, "id": 3, "true_value": 375000, "desc": "This updated 2-bedroom, 2-bath home offers a perfect blend of comfort and convenience in a safe urban neighborhood. With a modern HVAC system, efficient water heater, and manageable size, it’s ideal for downsizing. The home features hardwood floors, a single-car garage, a bright living room, and a modern kitchen. Close to healthcare and public transport, it provides hassle-free living. Fresh paint and affordability make this home a great choice for a comfortable, low-maintenance lifestyle."} 
{"trait": "Downsizing", "name": "House 4", "price": 160000, "id": 3, "true_value": 400000, "desc": "This 2-bedroom, 2-bath home in a vibrant urban area is perfect for a downsizing lifestyle. Built in 2000, it features modern appliances, hardwood floors, and an updated kitchen. Conveniently located near healthcare and shopping, it ensures ease of living. With a high-efficiency HVAC system and water heater (installed in 2015), plus a neighborhood safety rating of 9, this low-maintenance property offers comfort and peace of mind. A reasonable HOA fee adds to its appeal for a hassle-free transition."} 
{"trait": "Investment Buyers", "name": "House 5", "price": 180000, "id": 4, "true_value": 400000, "desc": "This 3-bedroom, 2-bath home is a prime investment opportunity with a strong rental history. Built in 2000, it features a recently updated kitchen and bathrooms, modern appliances, hardwood floors, and high ceilings. The HVAC system and water heater are under 5 years old, ensuring low maintenance. Located near shopping malls and major highways in a safe neighborhood (rating: 8), this property offers excellent tenant appeal. With a competitive asking price, it’s an ideal choice for generating passive income."} 
{"trait": "Investment Buyers", "name": "House 6", "price": 180000, "id": 4, "true_value": 450000, "desc": "This 3-bedroom, 2-bath property is a standout investment with a strong rental history. Spanning 2,000 sq. ft., it features an updated kitchen with modern appliances, a finished basement with external entry, hardwood floors, and a two-story living room. Fresh exterior paint, a durable roof, and solar panels enhance its appeal. Located in a safe cul-de-sac near parks, trails, shopping, and major highways, it offers excellent tenant draw. With energy-efficient upgrades like an HVAC system and solar panels, this property is a smart choice for generating steady passive income."} 
{"trait": "Investment Buyers", "name": "House 7", "price": 170000, "id": 4, "true_value": 400000, "desc": "This 3-bedroom, 2-bath property is a prime addition to your rental portfolio. Built in 2000 with a proven rental history, it features a modern kitchen, updated bathrooms, hardwood floors, and high ceilings. Recent updates to the HVAC system and water heater ensure low maintenance. Conveniently located near shopping malls and major highways in a safe neighborhood, it also boasts a fresh exterior, a generous lot with an irrigation system, and a two-story living room. Priced competitively, this property is a smart investment for consistent rental income."} 
{"trait": "Investment Buyers", "name": "House 8", "price": 180000, "id": 4, "true_value": 450000, "desc": "This 3-bedroom, 2-bath property, built in 2005, is a lucrative investment with a strong rental history. Spanning 2,000 sq. ft., it features an updated kitchen and bathrooms, hardwood floors, high ceilings, and a two-story living room. Recent upgrades to the HVAC system and water heater (2018) ensure efficiency and low maintenance. Located in a sought-after neighborhood with a 9/10 safety rating, near shopping malls and major highways, this property offers tenant appeal and steady passive income potential. Competitively priced, it’s an excellent addition to your investment portfolio."} 
{"trait": "Relocation for Work", "name": "Property 1", "price": 170000, "id": 5, "true_value": 425000, "desc": "Ideal for professionals relocating for work, this 3-bedroom, 2-bath urban home offers convenience and comfort just minutes from downtown. Built in 2000, the 1,800 sq. ft. property features a modern kitchen, hardwood floors, high ceilings, and a spacious living room. Recent updates to the HVAC system and water heater ensure year-round comfort. Located in a safe neighborhood near parks, shopping, and major highways, with a low HOA fee and a two-car garage, this home is perfect for easy commuting and hassle-free living."} 
{"trait": "Relocation for Work", "name": "Property 2", "price": 160000, "id": 5, "true_value": 400000, "desc": "Perfect for professionals seeking easy downtown access, this updated 3-bedroom, 2-bath home combines comfort and convenience. Built in 2000, it features hardwood floors, high ceilings, a modern kitchen with updated appliances, and a spacious 2-car garage. Recent upgrades include a 2018 HVAC system and water heater. Situated in a safe, 8-rated neighborhood near trails, parks, and shopping malls, this home offers a generous lot and a freshly painted exterior, making it ideal for a hassle-free relocation."} 
{"trait": "Relocation for Work", "name": "Property 3", "price": 180000, "id": 5, "true_value": 450000, "desc": "Modern 3-bedroom, 2-bath home in a vibrant urban area, built in 2010. This 1,800 sq. ft. property features hardwood floors, high ceilings, an updated kitchen, and a serene master suite with a luxurious bath. Includes a 2-car garage and private backyard. Conveniently located near downtown, parks, and shopping, in a safe neighborhood (8/10). Equipped with a new HVAC system and water heater for comfort and efficiency."} 
{"trait": "Relocation for Work", "name": "Property 4", "price": 170000, "id": 5, "true_value": 425000, "desc": "Modern 3-bedroom, 2-bath urban home, ideal for professionals. Recently updated with modern appliances and fresh paint, it features an open-concept kitchen, hardwood floors, high ceilings, and crown molding. Conveniently located near downtown, parks, and shopping, it offers easy commuting. A new HVAC system and water heater ensure year-round comfort. Situated in a safe neighborhood (rating 9) with no HOA fees, this home is a perfect city retreat."} 
{"trait": "Vacation Homes", "name": "Property 5", "price": 200000, "id": 6, "true_value": 500000, "desc": "Escape to your dream vacation home between serene beaches and majestic mountains. This 4-bedroom, 3-bath retreat, built in 2005, offers 2,500 sq. ft. of space with high ceilings, hardwood floors, and a modern kitchen. Relax by the private swimming pool or explore nearby trails, parks, and shopping. With a two-car garage, updated HVAC system, and a safe, family-friendly location, this home is perfect for unforgettable getaways."} 
{"trait": "Vacation Homes", "name": "Property 6", "price": 220000, "id": 6, "true_value": 550000, "desc": "Experience the perfect vacation getaway in this 4-bedroom, 3-bath home nestled between mountains and beaches. Featuring a modern kitchen, updated bathrooms, and an open floor plan with high ceilings, it offers both comfort and luxury. A finished basement with natural light, two-car garage, and new HVAC system ensure convenience and peace of mind. Located in a safe, 9-rated neighborhood near trails and shopping, this property is ideal for relaxing getaways or as a rental investment."} 
{"trait": "Vacation Homes", "name": "Property 7", "price": 200000, "id": 6, "true_value": 550000, "desc": "Escape to this 4-bedroom, 3-bath vacation home between mountains and beaches. With an updated kitchen, modern bathrooms, hardwood floors, and high ceilings, it offers both comfort and style. The property features a swimming pool, a finished basement with natural light, and a double garage. Located in a safe neighborhood near trails, parks, and shopping, it’s perfect as a second home or future retirement retreat. A well-maintained gem at exceptional value."} 
{"trait": "Vacation Homes", "name": "Property 8", "price": 230000, "id": 6, "true_value": 575000, "desc": "Your ideal vacation home awaits between serene beaches and majestic mountains. This 4-bedroom, 3-bath retreat features a modern kitchen, high ceilings, a two-story living room, and a main-floor master suite. With hardwood floors, a finished basement, updated HVAC, and a new water heater, it offers comfort and convenience. The all-brick exterior, fresh paint, and two-car garage complete the package. Located near parks, trails, and shopping, it’s perfect for family getaways or a future retirement retreat."} 
{"trait": "Eco-Conscious Buyers", "name": "Item 1", "price": 160000, "id": 7, "true_value": 400000, "desc": "This energy-efficient 3-bedroom, 2-bath home, built in 2015, is perfect for eco-conscious buyers. It features solar panels, a modern HVAC system, and an irrigation system for reduced energy and water use. With hardwood floors, high ceilings, and an updated kitchen, it combines sustainability with style. Located near trails and parks in a safe neighborhood (rated 8), this home offers a peaceful, green lifestyle with no HOA fees."} 
{"trait": "Eco-Conscious Buyers", "name": "Item 2", "price": 180000, "id": 7, "true_value": 450000, "desc": "Perfect for eco-conscious buyers, this 3-bedroom, 2-bath home, built in 2015, features solar panels, a modern HVAC system, and a sustainable all-brick exterior. The updated kitchen, finished basement, and hardwood floors offer comfort and style. Located near trails and parks in a green community with a high safety rating, this energy-efficient home blends sustainability with modern living."} 
{"trait": "Eco-Conscious Buyers", "name": "Item 3", "price": 170000, "id": 7, "true_value": 425000, "desc": "Built in 2015, this energy-efficient 3-bedroom, 2-bath home features solar panels, a modern HVAC system, and sustainable materials. The updated kitchen includes energy-saving appliances, while high ceilings, hardwood floors, and fresh paint add a touch of elegance. The well-lit basement with external entry offers versatile space, and the irrigation system ensures a lush lawn year-round. Located in a green community near trails and parks, with a safety rating of 8/10 and a manageable HOA fee, this home seamlessly blends sustainability with comfort."} 
{"trait": "Eco-Conscious Buyers", "name": "Item 4", "price": 180000, "id": 7, "true_value": 450000, "desc": "Built in 2015, this energy-efficient 3-bedroom, 2-bath home features solar panels, a modern HVAC system, and energy-saving appliances. The updated kitchen, hardwood floors, high ceilings, and fresh paint add comfort and style. Located in a green community near trails and parks, with a generous lot and irrigation system, it’s perfect for sustainable living in a safe neighborhood."} 
{"trait": "Urban Dwellers", "name": "Item 5", "price": 150000, "id": 8, "true_value": 400000, "desc": "Modern 2-bedroom, 2-bath condo in the heart of the city, featuring an open floor plan, updated kitchen with modern appliances, hardwood floors, and high ceilings. Located steps from dining, culture, and entertainment, the secure building offers urban convenience with a high safety rating. Recent HVAC and water heater upgrades, plus a reasonable HOA fee, make this a perfect fit for vibrant city living."} 
{"trait": "Urban Dwellers", "name": "Item 6", "price": 160000, "id": 8, "true_value": 425000, "desc": "Experience vibrant city living in this modern 2-bedroom, 2-bath home, built in 2015. Featuring a contemporary kitchen, hardwood floors, high ceilings, and fresh paint, it combines style and convenience. Located near public transit, dining, and entertainment, with a 9/10 safety rating, it’s perfect for urban dwellers. Recent HVAC and water heater upgrades ensure comfort, while a reasonable HOA fee adds value."} 
{"trait": "Urban Dwellers", "name": "Item 7", "price": 150000, "id": 8, "true_value": 400000, "desc": "This modern 2-bedroom, 2-bath home in the city center offers effortless access to dining, culture, and entertainment. With an updated kitchen, hardwood floors, high ceilings, and fresh paint, it exudes contemporary charm. Located near public transit in a safe neighborhood, it’s ideal for urban dwellers seeking comfort and convenience. A new HVAC system and reasonable HOA fee complete the package."} 
{"trait": "Urban Dwellers", "name": "Item 8", "price": 150000, "id": 8, "true_value": 400000, "desc": "This renovated 2-bedroom, 2-bath urban home is ideally located near the city center and major transport hubs. Featuring an updated kitchen, modern appliances, hardwood floors, and high ceilings, it offers style and convenience. Close to parks, dining, and shopping in a safe neighborhood with a high safety rating, it’s perfect for city dwellers. Recent HVAC and water heater upgrades add comfort and efficiency."} 
{"trait": "Rural Home Seekers", "name": "Construction 1", "price": 200000, "id": 9, "true_value": 500000, "desc": "This 4-bedroom, 3-bath rural retreat offers a perfect blend of charm and functionality on a spacious lot ideal for farming or a peaceful lifestyle. Featuring an updated kitchen, hardwood floors, high ceilings, and a two-story living room, it combines modern comfort with rustic appeal. Equipped with a modern HVAC system, water heater, and access to nearby trails and parks, it’s perfect for those seeking tranquility in the countryside."} 
{"trait": "Rural Home Seekers", "name": "Construction 2", "price": 190000, "id": 9, "true_value": 475000, "desc": "This 4-bedroom, 3-bath rural retreat offers a perfect blend of charm and functionality on a spacious lot ideal for farming or a peaceful lifestyle. Featuring an updated kitchen, hardwood floors, high ceilings, and a two-story living room, it combines modern comfort with rustic appeal. Equipped with a modern HVAC system, water heater, and access to nearby trails and parks, it’s perfect for those seeking tranquility in the countryside."} 
{"trait": "Rural Home Seekers", "name": "Construction 3", "price": 200000, "id": 9, "true_value": 500000, "desc": "Embrace serene rural living in this updated farmhouse on a large lot, ideal for farming. Featuring a modern kitchen, hardwood floors, high ceilings, and a recently updated HVAC system, it combines comfort with practicality. Located on a quiet cul-de-sac near trails and parks, with a high-rated local school, it’s perfect for a family seeking a peaceful lifestyle. Fresh paint and an irrigation system make it move-in ready for farming or relaxation."} 
{"trait": "Rural Home Seekers", "name": "Construction 4", "price": 200000, "id": 9, "true_value": 500000, "desc": "Experience rural charm with modern comfort in this newly painted farmhouse on a spacious lot, perfect for farming. It features a modern kitchen, hardwood floors, high ceilings, and an efficient HVAC system. Located on a peaceful cul-de-sac, with a high-rated local school and a two-car garage, this home offers tranquility and convenience. An irrigation system adds functionality, making it a perfect retreat for those seeking a farming lifestyle."} 
{"trait": "Multigenerational Living", "name": "Construction 5", "price": 230000, "id": 10, "true_value": 575000, "desc": "This 5-bedroom, 3-bath home is ideal for multigenerational living, offering ample space with a modern kitchen, updated bathrooms, and a finished basement with external entry. Features include a new HVAC system, hardwood floors, high ceilings, and a two-car garage. Located on a cul-de-sac near parks, shopping, and highways, in a safe community with excellent schools, it provides comfort and convenience for all ages. The well-maintained yard with an irrigation system adds to its appeal."} 
{"trait": "Multigenerational Living", "name": "Construction 6", "price": 200000, "id": 10, "true_value": 525000, "desc": "This 4-bedroom, 3-bath home is perfect for multigenerational living, featuring a modern kitchen, updated bathrooms, and hardwood floors throughout. The finished basement with external entry and natural light offers versatile space for extended family. Situated on a quiet cul-de-sac, the home includes a two-car garage, an irrigation system, and a high-efficiency HVAC system. Close to parks, shopping, and top-rated schools, it combines comfort, convenience, and a safe neighborhood for the whole family."} 
{"trait": "Multigenerational Living", "name": "Construction 7", "price": 240000, "id": 10, "true_value": 600000, "desc": "This spacious 4-bedroom, 3-bath home is perfect for multigenerational living, featuring a finished basement with external entry, double kitchens, and a two-story living room. High ceilings, hardwood floors, and modern appliances enhance its charm, while a large lot provides ample space for outdoor activities. Situated on a quiet cul-de-sac in a safe neighborhood, it’s close to parks, shopping, and top-rated schools. With a new HVAC system, water heater, and fresh paint, this updated home is ideal for comfortable family living."} 
{"trait": "Multigenerational Living", "name": "Construction 8", "price": 240000, "id": 10, "true_value": 600000, "desc": "This spacious 4-bedroom, 3-bath home is ideal for multigenerational living, offering double kitchens, a finished basement with external entry, and ample living space. Features include hardwood floors, high ceilings, crown molding, and updated kitchen and bathrooms. Situated on a large lot with an irrigation system, it’s close to parks, shopping, and located in a safe neighborhood. With a modern HVAC system and a two-story living room, this home combines comfort, style, and convenience for a large family."} 